<?php
// $items = [10 => "хліб", 20 => "молоко", 30 => "бутерброд"];
// arsort($items); // строки сортируются в алфавитном // порядке, ключи теряются 
// print_r($items); 
// $rev_items = ["хліб" => 10, "бутерброд" => 30, "молоко" => 20]; 
// arsort($rev_items); // числа сортуються за зростанням, // ключі губляться 
// print_r($rev_items);

$books = ["Джоан Роулінг"=>"Гаррі Поттер та таємна кімната",
  "Конан Дойл"=>"Пригоди Шерлока Холмса",
  "Толкіен"=>"Володар кілець"
];
ksort($books); 
print_r($books);